[Killed] ArithmeticOperator
src/math.ts:2:10
 export function add(a: number, b: number): number {
-  return a + b;
+  return a - b;
 }
 
killedBy: add should add two positive numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] EqualityOperator
src/math.ts:6:7
 }
 
 export function factorial(n: number): number {
-  if (n < 0) throw new Error('Negative input');
+  if (n >= 0) throw new Error('Negative input');
   if (n <= 1) return 1;
   return n * factorial(n - 1);
killedBy: factorial should return 1 for n = 0
statusReason: Error: Negative input

[Killed] ConditionalExpression
src/math.ts:6:7
 }
 
 export function factorial(n: number): number {
-  if (n < 0) throw new Error('Negative input');
+  if (false) throw new Error('Negative input');
   if (n <= 1) return 1;
   return n * factorial(n - 1);
killedBy: factorial should throw an error for negative input n = -1
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Negative input"

Received function did not throw

[Killed] ConditionalExpression
src/math.ts:7:7
 
 export function factorial(n: number): number {
   if (n < 0) throw new Error('Negative input');
-  if (n <= 1) return 1;
+  if (false) return 1;
   return n * factorial(n - 1);
 }
killedBy: factorial should return 1 for n = 0
statusReason: Error: Negative input

[Killed] EqualityOperator
src/math.ts:7:7
 
 export function factorial(n: number): number {
   if (n < 0) throw new Error('Negative input');
-  if (n <= 1) return 1;
+  if (n > 1) return 1;
   return n * factorial(n - 1);
 }
killedBy: factorial should return 1 for n = 0
statusReason: Error: Negative input

[Killed] ArithmeticOperator
src/math.ts:8:24
 export function factorial(n: number): number {
   if (n < 0) throw new Error('Negative input');
   if (n <= 1) return 1;
-  return n * factorial(n - 1);
+  return n * factorial(n + 1);
 }
killedBy: factorial should return 2 for n = 2
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
src/math.ts:8:10
 export function factorial(n: number): number {
   if (n < 0) throw new Error('Negative input');
   if (n <= 1) return 1;
-  return n * factorial(n - 1);
+  return n / factorial(n - 1);
 }
killedBy: factorial should return 6 for n = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1.5
