[Killed] ObjectLiteral
src/models/StateMachine.ts:56:12
   }
 
   getContext(): Record<string, unknown> {
-    return { ...this.context };
+    return {};
   }
 
killedBy: StateMachine create should create a StateMachine with options
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "count": 0,
- }

[Killed] BlockStatement
src/models/StateMachine.ts:59:53
     return { ...this.context };
   }
 
-  setContext(update: Record<string, unknown>): void {
-    this.context = { ...this.context, ...update };
-  }
+  setContext(update: Record<string, unknown>): void {}
 
   getHistory(): TState[] {
killedBy: StateMachine setContext should update the context
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "key": "value",
- }

[Killed] MethodExpression
src/models/StateMachine.ts:68:12
   }
 
   canTransition(event: TEvent): boolean {
-    return this.transitions.some(
-      (t) =>
-        t.from === this.current &&
-        t.event === event &&
-        (!t.guard || t.guard(this.context))
-    );
+    return this.transitions.every(t => t.from === this.current && t.event === event && (!t.guard || t.guard(this.context)));
   }
 
killedBy: StateMachine canTransition should return true for valid transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/models/StateMachine.ts:69:7
 
   canTransition(event: TEvent): boolean {
     return this.transitions.some(
-      (t) =>
-        t.from === this.current &&
-        t.event === event &&
-        (!t.guard || t.guard(this.context))
+      () => undefined
     );
   }
killedBy: StateMachine canTransition should return true for valid transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/models/StateMachine.ts:70:9
   canTransition(event: TEvent): boolean {
     return this.transitions.some(
       (t) =>
-        t.from === this.current &&
-        t.event === event &&
+        t.from === this.current || t.event === event &&
         (!t.guard || t.guard(this.context))
     );
killedBy: StateMachine canTransition should return false for invalid transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/StateMachine.ts:70:9
   canTransition(event: TEvent): boolean {
     return this.transitions.some(
       (t) =>
-        t.from === this.current &&
-        t.event === event &&
-        (!t.guard || t.guard(this.context))
+        true
     );
   }
killedBy: StateMachine canTransition should return false for invalid transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/models/StateMachine.ts:71:9
     return this.transitions.some(
       (t) =>
         t.from === this.current &&
-        t.event === event &&
+        t.event !== event &&
         (!t.guard || t.guard(this.context))
     );
killedBy: StateMachine canTransition should return true for valid transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/StateMachine.ts:71:9
     return this.transitions.some(
       (t) =>
         t.from === this.current &&
-        t.event === event &&
+        true &&
         (!t.guard || t.guard(this.context))
     );
killedBy: StateMachine canTransition should return false for invalid transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/StateMachine.ts:72:10
       (t) =>
         t.from === this.current &&
         t.event === event &&
-        (!t.guard || t.guard(this.context))
+        (true)
     );
   }
killedBy: StateMachine canTransition should respect guard conditions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/models/StateMachine.ts:79:9
   getAvailableEvents(): TEvent[] {
     return [
       ...new Set(
-        this.transitions
-          .filter(
-            (t) =>
-              t.from === this.current &&
-              (!t.guard || t.guard(this.context))
-          )
+        this.transitions
           .map((t) => t.event)
       ),
killedBy: StateMachine getAvailableEvents should return available events for current state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    "FETCH",
+   "RESOLVE",

[Killed] ArrowFunction
src/models/StateMachine.ts:81:13
       ...new Set(
         this.transitions
           .filter(
-            (t) =>
-              t.from === this.current &&
-              (!t.guard || t.guard(this.context))
+            () => undefined
           )
           .map((t) => t.event)
killedBy: StateMachine getAvailableEvents should return available events for current state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "FETCH",
- ]

[Killed] ConditionalExpression
src/models/StateMachine.ts:82:15
         this.transitions
           .filter(
             (t) =>
-              t.from === this.current &&
-              (!t.guard || t.guard(this.context))
+              true
           )
           .map((t) => t.event)
killedBy: StateMachine getAvailableEvents should return available events for current state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    "FETCH",
+   "RESOLVE",

[Killed] ConditionalExpression
src/models/StateMachine.ts:82:15
         this.transitions
           .filter(
             (t) =>
-              t.from === this.current &&
+              true &&
               (!t.guard || t.guard(this.context))
           )
killedBy: StateMachine getAvailableEvents should return available events for current state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    "FETCH",
+   "RESOLVE",

[Killed] ConditionalExpression
src/models/StateMachine.ts:83:16
           .filter(
             (t) =>
               t.from === this.current &&
-              (!t.guard || t.guard(this.context))
+              (true)
           )
           .map((t) => t.event)
killedBy: StateMachine getAvailableEvents should filter out events with failing guards
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "FETCH",
    "RESET",

[Killed] ArrowFunction
src/models/StateMachine.ts:92:7
 
   transition(event: TEvent): TState {
     const rule = this.transitions.find(
-      (t) =>
-        t.from === this.current &&
-        t.event === event &&
-        (!t.guard || t.guard(this.context))
+      () => undefined
     );
 
killedBy: StateMachine getState should return the current state after transition
statusReason: Error: No valid transition for event "FETCH" from state "idle". Available events: [FETCH]

[Killed] ConditionalExpression
src/models/StateMachine.ts:93:9
   transition(event: TEvent): TState {
     const rule = this.transitions.find(
       (t) =>
-        t.from === this.current &&
-        t.event === event &&
-        (!t.guard || t.guard(this.context))
+        false
     );
 
killedBy: StateMachine getState should return the current state after transition
statusReason: Error: No valid transition for event "FETCH" from state "idle". Available events: [FETCH]

[Killed] LogicalOperator
src/models/StateMachine.ts:93:9
   transition(event: TEvent): TState {
     const rule = this.transitions.find(
       (t) =>
-        t.from === this.current &&
-        t.event === event &&
-        (!t.guard || t.guard(this.context))
+        t.from === this.current && t.event === event || !t.guard || t.guard(this.context)
     );
 
killedBy: StateMachine getState should return the correct state after multiple transitions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "success"
Received: "loading"

[Killed] EqualityOperator
src/models/StateMachine.ts:111:9
     this.hooks.onExit?.(previous, rule.to);
 
     this.history.push(previous);
-    if (this.history.length > this.maxHistory) {
+    if (this.history.length >= this.maxHistory) {
       this.history.shift();
     }
killedBy: StateMachine getHistory should respect maxHistory
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "loading",
    "success",

[Killed] ConditionalExpression
src/models/StateMachine.ts:111:9
     this.hooks.onExit?.(previous, rule.to);
 
     this.history.push(previous);
-    if (this.history.length > this.maxHistory) {
+    if (false) {
       this.history.shift();
     }
killedBy: StateMachine getHistory should respect maxHistory
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "idle",
    "loading",

[Killed] BlockStatement
src/models/StateMachine.ts:131:32
     return this.current;
   }
 
-  reset(initial: TState): void {
-    this.current = initial;
-    this.history.length = 0;
-    this.context = {};
-  }
+  reset(initial: TState): void {}
 
   serialize(): string {
killedBy: StateMachine reset should reset to the given state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "idle"
Received: "success"

[Killed] ArrayDeclaration
src/models/StateMachine.ts:140:16
   serialize(): string {
     const snapshot: StateMachineSnapshot<TState> = {
       current: this.current,
-      history: [...this.history],
+      history: [],
       context: this.context,
     };
killedBy: StateMachine serialize should serialize after transitions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "idle",
-   "loading",

[Killed] BlockStatement
src/models/StateMachine.ts:146:35
     return JSON.stringify(snapshot);
   }
 
-  deserialize(json: string): void {
-    const snapshot: StateMachineSnapshot<TState> = JSON.parse(json);
-    if (!snapshot.current || !Array.isArray(snapshot.history)) {
-      throw new Error('Invalid snapshot format');
-    }
-    this.current = snapshot.current;
-    this.history.length = 0;
-    this.history.push(...snapshot.history);
-    this.context = snapshot.context ?? {};
-  }
+  deserialize(json: string): void {}
 }
 
killedBy: StateMachine deserialize should restore state from JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "loading"
Received: "idle"

[Killed] ConditionalExpression
src/models/StateMachine.ts:148:9
 
   deserialize(json: string): void {
     const snapshot: StateMachineSnapshot<TState> = JSON.parse(json);
-    if (!snapshot.current || !Array.isArray(snapshot.history)) {
+    if (false) {
       throw new Error('Invalid snapshot format');
     }
killedBy: StateMachine deserialize should throw for invalid snapshot format (missing current)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid snapshot format"

Received function did not throw

[Killed] BooleanLiteral
src/models/StateMachine.ts:148:9
 
   deserialize(json: string): void {
     const snapshot: StateMachineSnapshot<TState> = JSON.parse(json);
-    if (!snapshot.current || !Array.isArray(snapshot.history)) {
+    if (snapshot.current || !Array.isArray(snapshot.history)) {
       throw new Error('Invalid snapshot format');
     }
killedBy: StateMachine deserialize should restore state from JSON
statusReason: Error: Invalid snapshot format

[Killed] LogicalOperator
src/models/StateMachine.ts:154:20
     this.current = snapshot.current;
     this.history.length = 0;
     this.history.push(...snapshot.history);
-    this.context = snapshot.context ?? {};
+    this.context = snapshot.context && {};
   }
 }
killedBy: StateMachine deserialize should restore state from JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "key": "value",
- }
