[Killed] ConditionalExpression
src/services/EventBus.ts:14:9
   private wildcardListeners: Subscription[] = [];
 
   on(event: string, handler: EventHandler, priority = 0): () => void {
-    if (event === '*') {
+    if (false) {
       this.wildcardListeners.push({ handler, priority, once: false });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
killedBy: EventBus on should register wildcard listener with *
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "someEvent", "data"

Number of calls: 0

[Killed] BlockStatement
src/services/EventBus.ts:14:24
   private wildcardListeners: Subscription[] = [];
 
   on(event: string, handler: EventHandler, priority = 0): () => void {
-    if (event === '*') {
-      this.wildcardListeners.push({ handler, priority, once: false });
-      this.wildcardListeners.sort((a, b) => b.priority - a.priority);
-      return () => this.off('*', handler);
-    }
+    if (event === '*') {}
 
     if (!this.listeners.has(event)) {
killedBy: EventBus on should register wildcard listener with *
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "someEvent", "data"

Number of calls: 0

[Killed] BooleanLiteral
src/services/EventBus.ts:15:62
 
   on(event: string, handler: EventHandler, priority = 0): () => void {
     if (event === '*') {
-      this.wildcardListeners.push({ handler, priority, once: false });
+      this.wildcardListeners.push({ handler, priority, once: true });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
       return () => this.off('*', handler);
killedBy: EventBus on should call wildcard handler for every event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ArithmeticOperator
src/services/EventBus.ts:16:45
   on(event: string, handler: EventHandler, priority = 0): () => void {
     if (event === '*') {
       this.wildcardListeners.push({ handler, priority, once: false });
-      this.wildcardListeners.sort((a, b) => b.priority - a.priority);
+      this.wildcardListeners.sort((a, b) => b.priority + a.priority);
       return () => this.off('*', handler);
     }
killedBy: EventBus on should sort wildcard listeners by priority
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
    1,

[Killed] MethodExpression
src/services/EventBus.ts:16:7
   on(event: string, handler: EventHandler, priority = 0): () => void {
     if (event === '*') {
       this.wildcardListeners.push({ handler, priority, once: false });
-      this.wildcardListeners.sort((a, b) => b.priority - a.priority);
+      this.wildcardListeners;
       return () => this.off('*', handler);
     }
killedBy: EventBus on should sort wildcard listeners by priority
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
    1,

[Killed] ArrowFunction
src/services/EventBus.ts:17:14
     if (event === '*') {
       this.wildcardListeners.push({ handler, priority, once: false });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
-      return () => this.off('*', handler);
+      return () => undefined;
     }
 
killedBy: EventBus integration scenarios should handle wildcard unsubscribe from on() return value
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "test"

[Killed] ConditionalExpression
src/services/EventBus.ts:20:9
       return () => this.off('*', handler);
     }
 
-    if (!this.listeners.has(event)) {
+    if (true) {
       this.listeners.set(event, []);
     }
killedBy: EventBus on should call handlers in priority order (higher priority first)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
-   10,
    5,

[Killed] BooleanLiteral
src/services/EventBus.ts:20:9
       return () => this.off('*', handler);
     }
 
-    if (!this.listeners.has(event)) {
+    if (this.listeners.has(event)) {
       this.listeners.set(event, []);
     }
killedBy: EventBus on should register a handler and call it on emit
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
src/services/EventBus.ts:25:42
     }
 
     const subs = this.listeners.get(event)!;
-    subs.push({ handler, priority, once: false });
+    subs.push({ handler, priority, once: true });
     subs.sort((a, b) => b.priority - a.priority);
 
killedBy: EventBus on should call handler multiple times on multiple emits
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Killed] MethodExpression
src/services/EventBus.ts:26:5
 
     const subs = this.listeners.get(event)!;
     subs.push({ handler, priority, once: false });
-    subs.sort((a, b) => b.priority - a.priority);
+    subs;
 
     return () => this.off(event, handler);
killedBy: EventBus on should call handlers in priority order (higher priority first)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   1,
    10,

[Killed] ArithmeticOperator
src/services/EventBus.ts:26:25
 
     const subs = this.listeners.get(event)!;
     subs.push({ handler, priority, once: false });
-    subs.sort((a, b) => b.priority - a.priority);
+    subs.sort((a, b) => b.priority + a.priority);
 
     return () => this.off(event, handler);
killedBy: EventBus on should call handlers in priority order (higher priority first)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   1,
    10,

[Killed] ArrowFunction
src/services/EventBus.ts:28:12
     subs.push({ handler, priority, once: false });
     subs.sort((a, b) => b.priority - a.priority);
 
-    return () => this.off(event, handler);
+    return () => undefined;
   }
 
killedBy: EventBus on should return an unsubscribe function
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] ConditionalExpression
src/services/EventBus.ts:32:9
   }
 
   once(event: string, handler: EventHandler, priority = 0): () => void {
-    if (event === '*') {
+    if (true) {
       this.wildcardListeners.push({ handler, priority, once: true });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
killedBy: EventBus once should pass arguments to the handler
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "a", "b"
Received: "test", "a", "b"

Number of calls: 1

[Killed] ConditionalExpression
src/services/EventBus.ts:32:9
   }
 
   once(event: string, handler: EventHandler, priority = 0): () => void {
-    if (event === '*') {
+    if (false) {
       this.wildcardListeners.push({ handler, priority, once: true });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/services/EventBus.ts:33:62
 
   once(event: string, handler: EventHandler, priority = 0): () => void {
     if (event === '*') {
-      this.wildcardListeners.push({ handler, priority, once: true });
+      this.wildcardListeners.push({ handler, priority, once: false });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
       return () => this.off('*', handler);
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[NoCoverage] ArithmeticOperator
src/services/EventBus.ts:34:45
   once(event: string, handler: EventHandler, priority = 0): () => void {
     if (event === '*') {
       this.wildcardListeners.push({ handler, priority, once: true });
-      this.wildcardListeners.sort((a, b) => b.priority - a.priority);
+      this.wildcardListeners.sort((a, b) => b.priority + a.priority);
       return () => this.off('*', handler);
     }

[Survived] MethodExpression
src/services/EventBus.ts:34:7
   once(event: string, handler: EventHandler, priority = 0): () => void {
     if (event === '*') {
       this.wildcardListeners.push({ handler, priority, once: true });
-      this.wildcardListeners.sort((a, b) => b.priority - a.priority);
+      this.wildcardListeners;
       return () => this.off('*', handler);
     }

[NoCoverage] StringLiteral
src/services/EventBus.ts:35:29
     if (event === '*') {
       this.wildcardListeners.push({ handler, priority, once: true });
       this.wildcardListeners.sort((a, b) => b.priority - a.priority);
-      return () => this.off('*', handler);
+      return () => this.off("", handler);
     }
 

[Killed] BooleanLiteral
src/services/EventBus.ts:43:42
     }
 
     const subs = this.listeners.get(event)!;
-    subs.push({ handler, priority, once: true });
+    subs.push({ handler, priority, once: false });
     subs.sort((a, b) => b.priority - a.priority);
 
killedBy: EventBus once should register a handler that fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] MethodExpression
src/services/EventBus.ts:44:5
 
     const subs = this.listeners.get(event)!;
     subs.push({ handler, priority, once: true });
-    subs.sort((a, b) => b.priority - a.priority);
+    subs;
 
     return () => this.off(event, handler);
killedBy: EventBus once should respect priority ordering
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
    1,

[Killed] ArithmeticOperator
src/services/EventBus.ts:44:25
 
     const subs = this.listeners.get(event)!;
     subs.push({ handler, priority, once: true });
-    subs.sort((a, b) => b.priority - a.priority);
+    subs.sort((a, b) => b.priority + a.priority);
 
     return () => this.off(event, handler);
killedBy: EventBus once should respect priority ordering
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
    1,

[Killed] BlockStatement
src/services/EventBus.ts:49:51
     return () => this.off(event, handler);
   }
 
-  off(event: string, handler: EventHandler): void {
-    if (event === '*') {
-      this.wildcardListeners = this.wildcardListeners.filter(
-        (s) => s.handler !== handler
-      );
-      return;
-    }
-
-    const subs = this.listeners.get(event);
-    if (!subs) return;
-
-    const filtered = subs.filter((s) => s.handler !== handler);
-    if (filtered.length === 0) {
-      this.listeners.delete(event);
-    } else {
-      this.listeners.set(event, filtered);
-    }
-  }
+  off(event: string, handler: EventHandler): void {}
 
   async emit(event: string, ...args: unknown[]): Promise<void> {
killedBy: EventBus on should return an unsubscribe function
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] ConditionalExpression
src/services/EventBus.ts:50:9
   }
 
   off(event: string, handler: EventHandler): void {
-    if (event === '*') {
+    if (false) {
       this.wildcardListeners = this.wildcardListeners.filter(
         (s) => s.handler !== handler
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] EqualityOperator
src/services/EventBus.ts:50:9
   }
 
   off(event: string, handler: EventHandler): void {
-    if (event === '*') {
+    if (event !== '*') {
       this.wildcardListeners = this.wildcardListeners.filter(
         (s) => s.handler !== handler
killedBy: EventBus on should return an unsubscribe function
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] MethodExpression
src/services/EventBus.ts:51:32
 
   off(event: string, handler: EventHandler): void {
     if (event === '*') {
-      this.wildcardListeners = this.wildcardListeners.filter(
-        (s) => s.handler !== handler
-      );
+      this.wildcardListeners = this.wildcardListeners;
       return;
     }
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] EqualityOperator
src/services/EventBus.ts:52:16
   off(event: string, handler: EventHandler): void {
     if (event === '*') {
       this.wildcardListeners = this.wildcardListeners.filter(
-        (s) => s.handler !== handler
+        (s) => s.handler === handler
       );
       return;
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/services/EventBus.ts:52:16
   off(event: string, handler: EventHandler): void {
     if (event === '*') {
       this.wildcardListeners = this.wildcardListeners.filter(
-        (s) => s.handler !== handler
+        (s) => true
       );
       return;
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] EqualityOperator
src/services/EventBus.ts:60:41
     const subs = this.listeners.get(event);
     if (!subs) return;
 
-    const filtered = subs.filter((s) => s.handler !== handler);
+    const filtered = subs.filter((s) => s.handler === handler);
     if (filtered.length === 0) {
       this.listeners.delete(event);
killedBy: EventBus on should return an unsubscribe function
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] ConditionalExpression
src/services/EventBus.ts:60:41
     const subs = this.listeners.get(event);
     if (!subs) return;
 
-    const filtered = subs.filter((s) => s.handler !== handler);
+    const filtered = subs.filter((s) => true);
     if (filtered.length === 0) {
       this.listeners.delete(event);
killedBy: EventBus on should return an unsubscribe function
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] EqualityOperator
src/services/EventBus.ts:61:9
     if (!subs) return;
 
     const filtered = subs.filter((s) => s.handler !== handler);
-    if (filtered.length === 0) {
+    if (filtered.length !== 0) {
       this.listeners.delete(event);
     } else {
killedBy: EventBus off should not affect other handlers for the same event
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/services/EventBus.ts:61:32
     if (!subs) return;
 
     const filtered = subs.filter((s) => s.handler !== handler);
-    if (filtered.length === 0) {
-      this.listeners.delete(event);
-    } else {
+    if (filtered.length === 0) {} else {
       this.listeners.set(event, filtered);
     }
killedBy: EventBus on should return an unsubscribe function
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
src/services/EventBus.ts:63:12
     const filtered = subs.filter((s) => s.handler !== handler);
     if (filtered.length === 0) {
       this.listeners.delete(event);
-    } else {
-      this.listeners.set(event, filtered);
-    }
+    } else {}
   }
 
killedBy: EventBus off should not affect other handlers for the same event
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
src/services/EventBus.ts:74:29
     const subs = this.listeners.get(event) ?? [];
     const toRemove: EventHandler[] = [];
 
-    for (const sub of subs) {
-      try {
-        await sub.handler(...args);
-      } catch (err) {
-        errors.push(err instanceof Error ? err : new Error(String(err)));
-      }
-      if (sub.once) {
-        toRemove.push(sub.handler);
-      }
-    }
+    for (const sub of subs) {}
 
     for (const handler of toRemove) {
killedBy: EventBus on should register a handler and call it on emit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "arg1", "arg2"

Number of calls: 0

[Killed] BlockStatement
src/services/EventBus.ts:75:11
     const toRemove: EventHandler[] = [];
 
     for (const sub of subs) {
-      try {
-        await sub.handler(...args);
-      } catch (err) {
+      try {} catch (err) {
         errors.push(err instanceof Error ? err : new Error(String(err)));
       }
killedBy: EventBus on should register a handler and call it on emit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "arg1", "arg2"

Number of calls: 0

[Killed] BlockStatement
src/services/EventBus.ts:77:21
     for (const sub of subs) {
       try {
         await sub.handler(...args);
-      } catch (err) {
-        errors.push(err instanceof Error ? err : new Error(String(err)));
-      }
+      } catch (err) {}
       if (sub.once) {
         toRemove.push(sub.handler);
killedBy: EventBus emit should throw AggregateError when handler throws
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/services/EventBus.ts:80:11
       } catch (err) {
         errors.push(err instanceof Error ? err : new Error(String(err)));
       }
-      if (sub.once) {
+      if (true) {
         toRemove.push(sub.handler);
       }
killedBy: EventBus on should call handler multiple times on multiple emits
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Killed] BlockStatement
src/services/EventBus.ts:80:21
       } catch (err) {
         errors.push(err instanceof Error ? err : new Error(String(err)));
       }
-      if (sub.once) {
-        toRemove.push(sub.handler);
-      }
+      if (sub.once) {}
     }
 
killedBy: EventBus once should register a handler that fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/EventBus.ts:85:37
       }
     }
 
-    for (const handler of toRemove) {
-      this.off(event, handler);
-    }
+    for (const handler of toRemove) {}
 
     // Wildcard listeners receive the event name as the first argument
killedBy: EventBus once should register a handler that fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/EventBus.ts:91:47
 
     // Wildcard listeners receive the event name as the first argument
     const wildcardToRemove: EventHandler[] = [];
-    for (const sub of this.wildcardListeners) {
-      try {
-        await sub.handler(event, ...args);
-      } catch (err) {
-        errors.push(err instanceof Error ? err : new Error(String(err)));
-      }
-      if (sub.once) {
-        wildcardToRemove.push(sub.handler);
-      }
-    }
+    for (const sub of this.wildcardListeners) {}
 
     for (const handler of wildcardToRemove) {
killedBy: EventBus on should register wildcard listener with *
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "someEvent", "data"

Number of calls: 0

[Killed] BlockStatement
src/services/EventBus.ts:92:11
     // Wildcard listeners receive the event name as the first argument
     const wildcardToRemove: EventHandler[] = [];
     for (const sub of this.wildcardListeners) {
-      try {
-        await sub.handler(event, ...args);
-      } catch (err) {
+      try {} catch (err) {
         errors.push(err instanceof Error ? err : new Error(String(err)));
       }
killedBy: EventBus on should register wildcard listener with *
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "someEvent", "data"

Number of calls: 0

[Killed] BlockStatement
src/services/EventBus.ts:94:21
     for (const sub of this.wildcardListeners) {
       try {
         await sub.handler(event, ...args);
-      } catch (err) {
-        errors.push(err instanceof Error ? err : new Error(String(err)));
-      }
+      } catch (err) {}
       if (sub.once) {
         wildcardToRemove.push(sub.handler);
killedBy: EventBus emit should collect errors from both specific and wildcard handlers
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [[Error: specific error]]

[Killed] BlockStatement
src/services/EventBus.ts:97:21
       } catch (err) {
         errors.push(err instanceof Error ? err : new Error(String(err)));
       }
-      if (sub.once) {
-        wildcardToRemove.push(sub.handler);
-      }
+      if (sub.once) {}
     }
 
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/EventBus.ts:102:45
       }
     }
 
-    for (const handler of wildcardToRemove) {
-      this.off('*', handler);
-    }
+    for (const handler of wildcardToRemove) {}
 
     if (errors.length > 0) {
killedBy: EventBus once should register wildcard once listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/services/EventBus.ts:106:9
       this.off('*', handler);
     }
 
-    if (errors.length > 0) {
+    if (false) {
       throw new AggregateError(
         errors,
killedBy: EventBus emit should throw AggregateError when handler throws
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/services/EventBus.ts:106:9
       this.off('*', handler);
     }
 
-    if (errors.length > 0) {
+    if (errors.length <= 0) {
       throw new AggregateError(
         errors,
killedBy: EventBus on should register a handler and call it on emit
statusReason: AggregateError: 0 handler(s) threw during "test"

[Timeout] BlockStatement
src/services/EventBus.ts:115:45
   }
 
   waitFor(event: string, timeout = 5000): Promise<unknown[]> {
-    return new Promise((resolve, reject) => {
-      const timer = setTimeout(() => {
-        this.off(event, handler);
-        reject(new Error(`waitFor("${event}") timed out after ${timeout}ms`));
-      }, timeout);
-
-      const handler: EventHandler = (...args) => {
-        clearTimeout(timer);
-        resolve(args);
-      };
-
-      this.once(event, handler);
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Killed] BlockStatement
src/services/EventBus.ts:116:38
 
   waitFor(event: string, timeout = 5000): Promise<unknown[]> {
     return new Promise((resolve, reject) => {
-      const timer = setTimeout(() => {
-        this.off(event, handler);
-        reject(new Error(`waitFor("${event}") timed out after ${timeout}ms`));
-      }, timeout);
+      const timer = setTimeout(() => {}, timeout);
 
       const handler: EventHandler = (...args) => {
killedBy: EventBus waitFor should reject on timeout
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/services/EventBus.ts:121:50
         reject(new Error(`waitFor("${event}") timed out after ${timeout}ms`));
       }, timeout);
 
-      const handler: EventHandler = (...args) => {
-        clearTimeout(timer);
-        resolve(args);
-      };
+      const handler: EventHandler = (...args) => {};
 
       this.once(event, handler);
killedBy: EventBus waitFor should resolve when the event is emitted
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/services/EventBus.ts:131:9
   }
 
   listenerCount(event: string): number {
-    if (event === '*') {
+    if (false) {
       return this.wildcardListeners.length;
     }
killedBy: EventBus once should remove wildcard once listener after emit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/services/EventBus.ts:131:24
   }
 
   listenerCount(event: string): number {
-    if (event === '*') {
-      return this.wildcardListeners.length;
-    }
+    if (event === '*') {}
     return (this.listeners.get(event) ?? []).length;
   }
killedBy: EventBus once should remove wildcard once listener after emit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrayDeclaration
src/services/EventBus.ts:134:42
     if (event === '*') {
       return this.wildcardListeners.length;
     }
-    return (this.listeners.get(event) ?? []).length;
+    return (this.listeners.get(event) ?? ["Stryker was here"]).length;
   }
 
killedBy: EventBus once should remove once listener after emit and update listener count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/services/EventBus.ts:137:44
     return (this.listeners.get(event) ?? []).length;
   }
 
-  removeAllListeners(event?: string): void {
-    if (event === '*') {
-      this.wildcardListeners = [];
-    } else if (event) {
-      this.listeners.delete(event);
-    } else {
-      this.listeners.clear();
-      this.wildcardListeners = [];
-    }
-  }
+  removeAllListeners(event?: string): void {}
 }
 
killedBy: EventBus removeAllListeners should remove all listeners for a specific event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/services/EventBus.ts:138:9
   }
 
   removeAllListeners(event?: string): void {
-    if (event === '*') {
+    if (false) {
       this.wildcardListeners = [];
     } else if (event) {
killedBy: EventBus removeAllListeners should remove all wildcard listeners when event is *
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] EqualityOperator
src/services/EventBus.ts:138:9
   }
 
   removeAllListeners(event?: string): void {
-    if (event === '*') {
+    if (event !== '*') {
       this.wildcardListeners = [];
     } else if (event) {
killedBy: EventBus removeAllListeners should remove all listeners for a specific event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
src/services/EventBus.ts:140:23
   removeAllListeners(event?: string): void {
     if (event === '*') {
       this.wildcardListeners = [];
-    } else if (event) {
-      this.listeners.delete(event);
-    } else {
+    } else if (event) {} else {
       this.listeners.clear();
       this.wildcardListeners = [];
killedBy: EventBus removeAllListeners should remove all listeners for a specific event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
src/services/EventBus.ts:142:12
       this.wildcardListeners = [];
     } else if (event) {
       this.listeners.delete(event);
-    } else {
-      this.listeners.clear();
-      this.wildcardListeners = [];
-    }
+    } else {}
   }
 }
killedBy: EventBus removeAllListeners should remove all listeners when no event specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
