[Killed] BooleanLiteral
src/components/SearchableList.tsx:25:13
   onSelect,
   placeholder = 'Search...',
   debounceMs = 300,
-  loading = false,
+  loading = true,
   emptyMessage = 'No items available',
   noResultsMessage = 'No results found',
killedBy: SearchableList Initial render should render the searchable list with all items
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Loading"
      data-testid="searchable-list-loading"

[Killed] StringLiteral
src/components/SearchableList.tsx:27:22
   debounceMs = 300,
   loading = false,
   emptyMessage = 'No items available',
-  noResultsMessage = 'No results found',
+  noResultsMessage = "",
 }: SearchableListProps) {
   const [query, setQuery] = useState('');
killedBy: SearchableList Search/filtering with debounce should show no results message when no items match
statusReason: TestingLibraryElementError: Unable to find an element with the text: No results found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] UnaryOperator
src/components/SearchableList.tsx:31:50
 }: SearchableListProps) {
   const [query, setQuery] = useState('');
   const [filtered, setFiltered] = useState<SearchableListItem[]>(items);
-  const [activeIndex, setActiveIndex] = useState(-1);
+  const [activeIndex, setActiveIndex] = useState(+1);
   const listRef = useRef<HTMLUListElement>(null);
   const inputRef = useRef<HTMLInputElement>(null);
killedBy: SearchableList Initial render should not have aria-activedescendant initially
statusReason: Error: expect(element).not.toHaveAttribute("aria-activedescendant") // element.hasAttribute("aria-activedescendant")

Expected the element not to have attribute:
  aria-activedescendant
Received:
  aria-activedescendant="item-2"

[Killed] BlockStatement
src/components/SearchableList.tsx:35:19
   const listRef = useRef<HTMLUListElement>(null);
   const inputRef = useRef<HTMLInputElement>(null);
 
-  useEffect(() => {
-    const timer = setTimeout(() => {
-      if (query.trim() === '') {
-        setFiltered(items);
-      } else {
-        const lower = query.toLowerCase();
-        setFiltered(
-          items.filter(
-            (item) =>
-              item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
-          )
-        );
-      }
-      setActiveIndex(-1);
-    }, debounceMs);
-
-    return () => clearTimeout(timer);
-  }, [query, items, debounceMs]);
+  useEffect(() => {}, [query, items, debounceMs]);
 
   const handleKeyDown = useCallback(
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] BlockStatement
src/components/SearchableList.tsx:36:36
   const inputRef = useRef<HTMLInputElement>(null);
 
   useEffect(() => {
-    const timer = setTimeout(() => {
-      if (query.trim() === '') {
-        setFiltered(items);
-      } else {
-        const lower = query.toLowerCase();
-        setFiltered(
-          items.filter(
-            (item) =>
-              item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
-          )
-        );
-      }
-      setActiveIndex(-1);
-    }, debounceMs);
+    const timer = setTimeout(() => {}, debounceMs);
 
     return () => clearTimeout(timer);
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] MethodExpression
src/components/SearchableList.tsx:37:11
 
   useEffect(() => {
     const timer = setTimeout(() => {
-      if (query.trim() === '') {
+      if (query === '') {
         setFiltered(items);
       } else {
killedBy: SearchableList Search/filtering with debounce should treat whitespace-only query as empty
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-item-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] ConditionalExpression
src/components/SearchableList.tsx:37:11
 
   useEffect(() => {
     const timer = setTimeout(() => {
-      if (query.trim() === '') {
+      if (true) {
         setFiltered(items);
       } else {
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] BlockStatement
src/components/SearchableList.tsx:39:14
     const timer = setTimeout(() => {
       if (query.trim() === '') {
         setFiltered(items);
-      } else {
-        const lower = query.toLowerCase();
-        setFiltered(
-          items.filter(
-            (item) =>
-              item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
-          )
-        );
-      }
+      } else {}
       setActiveIndex(-1);
     }, debounceMs);
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] MethodExpression
src/components/SearchableList.tsx:40:23
       if (query.trim() === '') {
         setFiltered(items);
       } else {
-        const lower = query.toLowerCase();
+        const lower = query.toUpperCase();
         setFiltered(
           items.filter(
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-item-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] MethodExpression
src/components/SearchableList.tsx:42:11
       } else {
         const lower = query.toLowerCase();
         setFiltered(
-          items.filter(
-            (item) =>
-              item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
-          )
+          items
         );
       }
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] ArrowFunction
src/components/SearchableList.tsx:43:13
         const lower = query.toLowerCase();
         setFiltered(
           items.filter(
-            (item) =>
-              item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
+            () => undefined
           )
         );
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-item-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] MethodExpression
src/components/SearchableList.tsx:44:15
         setFiltered(
           items.filter(
             (item) =>
-              item.label.toLowerCase().includes(lower) ||
+              item.label.toUpperCase().includes(lower) ||
               item.description?.toLowerCase().includes(lower)
           )
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-item-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] ConditionalExpression
src/components/SearchableList.tsx:44:15
         setFiltered(
           items.filter(
             (item) =>
-              item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
+              true
           )
         );
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] MethodExpression
src/components/SearchableList.tsx:45:15
           items.filter(
             (item) =>
               item.label.toLowerCase().includes(lower) ||
-              item.description?.toLowerCase().includes(lower)
+              item.description?.toUpperCase().includes(lower)
           )
         );
killedBy: SearchableList Search/filtering with debounce should filter by description
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-item-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Survived] UnaryOperator
src/components/SearchableList.tsx:49:22
           )
         );
       }
-      setActiveIndex(-1);
+      setActiveIndex(+1);
     }, debounceMs);
 

[Killed] MethodExpression
src/components/SearchableList.tsx:57:28
 
   const handleKeyDown = useCallback(
     (e: React.KeyboardEvent) => {
-      const enabledItems = filtered.filter((i) => !i.disabled);
+      const enabledItems = filtered;
 
       switch (e.key) {
killedBy: SearchableList Keyboard navigation should select correct enabled item on Enter with disabled items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "description": "A small red fruit",
-   "id": "3",

[Killed] ArrowFunction
src/components/SearchableList.tsx:57:44
 
   const handleKeyDown = useCallback(
     (e: React.KeyboardEvent) => {
-      const enabledItems = filtered.filter((i) => !i.disabled);
+      const enabledItems = filtered.filter(() => undefined);
 
       switch (e.key) {
killedBy: SearchableList Keyboard navigation should navigate up with ArrowUp
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] BlockStatement
src/components/SearchableList.tsx:60:27
       const enabledItems = filtered.filter((i) => !i.disabled);
 
       switch (e.key) {
-        case 'ArrowDown': {
-          e.preventDefault();
-          setActiveIndex((prev) => {
-            const next = prev + 1;
-            return next >= enabledItems.length ? 0 : next;
-          });
-          break;
-        }
+        case 'ArrowDown': {}
         case 'ArrowUp': {
           e.preventDefault();
killedBy: SearchableList Keyboard navigation should navigate down with ArrowDown
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:60:9
       const enabledItems = filtered.filter((i) => !i.disabled);
 
       switch (e.key) {
-        case 'ArrowDown': {
-          e.preventDefault();
-          setActiveIndex((prev) => {
-            const next = prev + 1;
-            return next >= enabledItems.length ? 0 : next;
-          });
-          break;
-        }
+        case 'ArrowDown':
         case 'ArrowUp': {
           e.preventDefault();
killedBy: SearchableList Keyboard navigation should navigate down with ArrowDown
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ArithmeticOperator
src/components/SearchableList.tsx:63:26
         case 'ArrowDown': {
           e.preventDefault();
           setActiveIndex((prev) => {
-            const next = prev + 1;
+            const next = prev - 1;
             return next >= enabledItems.length ? 0 : next;
           });
killedBy: SearchableList Keyboard navigation should navigate down with ArrowDown
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] EqualityOperator
src/components/SearchableList.tsx:64:20
           e.preventDefault();
           setActiveIndex((prev) => {
             const next = prev + 1;
-            return next >= enabledItems.length ? 0 : next;
+            return next > enabledItems.length ? 0 : next;
           });
           break;
killedBy: SearchableList Keyboard navigation should wrap around when navigating past the last item with ArrowDown
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:64:20
           e.preventDefault();
           setActiveIndex((prev) => {
             const next = prev + 1;
-            return next >= enabledItems.length ? 0 : next;
+            return true ? 0 : next;
           });
           break;
killedBy: SearchableList Keyboard navigation should skip disabled items in keyboard navigation
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] BlockStatement
src/components/SearchableList.tsx:68:25
           });
           break;
         }
-        case 'ArrowUp': {
-          e.preventDefault();
-          setActiveIndex((prev) => {
-            const next = prev - 1;
-            return next < 0 ? enabledItems.length - 1 : next;
-          });
-          break;
-        }
+        case 'ArrowUp': {}
         case 'Enter': {
           e.preventDefault();
killedBy: SearchableList Keyboard navigation should navigate up with ArrowUp
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:68:9
           });
           break;
         }
-        case 'ArrowUp': {
-          e.preventDefault();
-          setActiveIndex((prev) => {
-            const next = prev - 1;
-            return next < 0 ? enabledItems.length - 1 : next;
-          });
-          break;
-        }
+        case 'ArrowUp':
         case 'Enter': {
           e.preventDefault();
killedBy: SearchableList Keyboard navigation should navigate up with ArrowUp
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ArithmeticOperator
src/components/SearchableList.tsx:71:26
         case 'ArrowUp': {
           e.preventDefault();
           setActiveIndex((prev) => {
-            const next = prev - 1;
+            const next = prev + 1;
             return next < 0 ? enabledItems.length - 1 : next;
           });
killedBy: SearchableList Keyboard navigation should navigate up with ArrowUp
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ArithmeticOperator
src/components/SearchableList.tsx:72:31
           e.preventDefault();
           setActiveIndex((prev) => {
             const next = prev - 1;
-            return next < 0 ? enabledItems.length - 1 : next;
+            return next < 0 ? enabledItems.length + 1 : next;
           });
           break;
killedBy: SearchableList Keyboard navigation should navigate up with ArrowUp
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:72:20
           e.preventDefault();
           setActiveIndex((prev) => {
             const next = prev - 1;
-            return next < 0 ? enabledItems.length - 1 : next;
+            return false ? enabledItems.length - 1 : next;
           });
           break;
killedBy: SearchableList Keyboard navigation should navigate up with ArrowUp
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:76:9
           });
           break;
         }
-        case 'Enter': {
-          e.preventDefault();
-          if (activeIndex >= 0 && activeIndex < enabledItems.length) {
-            onSelect(enabledItems[activeIndex]);
-          }
-          break;
-        }
+        case 'Enter':
         case 'Escape': {
           e.preventDefault();
killedBy: SearchableList Keyboard navigation should select item on Enter when an item is active
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "A red fruit", "id": "1", "label": "Apple"}

Number of calls: 0

[Killed] BlockStatement
src/components/SearchableList.tsx:76:23
           });
           break;
         }
-        case 'Enter': {
-          e.preventDefault();
-          if (activeIndex >= 0 && activeIndex < enabledItems.length) {
-            onSelect(enabledItems[activeIndex]);
-          }
-          break;
-        }
+        case 'Enter': {}
         case 'Escape': {
           e.preventDefault();
killedBy: SearchableList Keyboard navigation should select item on Enter when an item is active
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "A red fruit", "id": "1", "label": "Apple"}

Number of calls: 0

[Killed] EqualityOperator
src/components/SearchableList.tsx:78:35
         }
         case 'Enter': {
           e.preventDefault();
-          if (activeIndex >= 0 && activeIndex < enabledItems.length) {
+          if (activeIndex >= 0 && activeIndex <= enabledItems.length) {
             onSelect(enabledItems[activeIndex]);
           }
killedBy: SearchableList Edge cases should handle all items being disabled
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: undefined

[Killed] LogicalOperator
src/components/SearchableList.tsx:78:15
         }
         case 'Enter': {
           e.preventDefault();
-          if (activeIndex >= 0 && activeIndex < enabledItems.length) {
+          if (activeIndex >= 0 || activeIndex < enabledItems.length) {
             onSelect(enabledItems[activeIndex]);
           }
killedBy: SearchableList Keyboard navigation should not select on Enter when no item is active
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: undefined

[Killed] ConditionalExpression
src/components/SearchableList.tsx:83:9
           }
           break;
         }
-        case 'Escape': {
-          e.preventDefault();
-          setQuery('');
-          inputRef.current?.blur();
-          break;
-        }
+        case 'Escape':
       }
     },
killedBy: SearchableList Keyboard navigation should clear query and blur input on Escape
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "apple"

[Killed] BlockStatement
src/components/SearchableList.tsx:83:24
           }
           break;
         }
-        case 'Escape': {
-          e.preventDefault();
-          setQuery('');
-          inputRef.current?.blur();
-          break;
-        }
+        case 'Escape': {}
       }
     },
killedBy: SearchableList Keyboard navigation should clear query and blur input on Escape
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "apple"

[Killed] BlockStatement
src/components/SearchableList.tsx:94:19
     [filtered, activeIndex, onSelect]
   );
 
-  useEffect(() => {
-    if (activeIndex >= 0 && listRef.current) {
-      const activeEl = listRef.current.querySelector('[data-active="true"]');
-      activeEl?.scrollIntoView({ block: 'nearest' });
-    }
-  }, [activeIndex]);
+  useEffect(() => {}, [activeIndex]);
 
   if (loading) {
killedBy: SearchableList Scroll into view should scroll active item into view
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"block": "nearest"}

Number of calls: 0

[Killed] EqualityOperator
src/components/SearchableList.tsx:95:9
   );
 
   useEffect(() => {
-    if (activeIndex >= 0 && listRef.current) {
+    if (activeIndex < 0 && listRef.current) {
       const activeEl = listRef.current.querySelector('[data-active="true"]');
       activeEl?.scrollIntoView({ block: 'nearest' });
killedBy: SearchableList Scroll into view should scroll active item into view
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"block": "nearest"}

Number of calls: 0

[Killed] BlockStatement
src/components/SearchableList.tsx:95:46
   );
 
   useEffect(() => {
-    if (activeIndex >= 0 && listRef.current) {
-      const activeEl = listRef.current.querySelector('[data-active="true"]');
-      activeEl?.scrollIntoView({ block: 'nearest' });
-    }
+    if (activeIndex >= 0 && listRef.current) {}
   }, [activeIndex]);
 
killedBy: SearchableList Scroll into view should scroll active item into view
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"block": "nearest"}

Number of calls: 0

[Killed] BlockStatement
src/components/SearchableList.tsx:101:16
     }
   }, [activeIndex]);
 
-  if (loading) {
-    return (
-      <div role="status" aria-label="Loading" data-testid="searchable-list-loading">
-        <span aria-hidden="true">Loading...</span>
-      </div>
-    );
-  }
+  if (loading) {}
 
   if (items.length === 0) {
killedBy: SearchableList Loading state should render loading indicator when loading is true
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] BlockStatement
src/components/SearchableList.tsx:109:27
     );
   }
 
-  if (items.length === 0) {
-    return (
-      <div role="status" data-testid="searchable-list-empty">
-        {emptyMessage}
-      </div>
-    );
-  }
+  if (items.length === 0) {}
 
   const enabledFiltered = filtered.filter((i) => !i.disabled);
killedBy: SearchableList Empty state should render empty message when items array is empty
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] EqualityOperator
src/components/SearchableList.tsx:109:7
     );
   }
 
-  if (items.length === 0) {
+  if (items.length !== 0) {
     return (
       <div role="status" data-testid="searchable-list-empty">
killedBy: SearchableList Initial render should render the searchable list with all items
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list-empty"
      role="status"

[Killed] ArrowFunction
src/components/SearchableList.tsx:117:43
     );
   }
 
-  const enabledFiltered = filtered.filter((i) => !i.disabled);
+  const enabledFiltered = filtered.filter(() => undefined);
 
   return (
killedBy: SearchableList Initial render should set all items as not active initially
statusReason: Error: expect(element).toHaveAttribute("data-active", "false") // element.getAttribute("data-active") === "false"

Expected the element to have attribute:
  data-active="false"
Received:
  data-active="true"

[Killed] BooleanLiteral
src/components/SearchableList.tsx:117:50
     );
   }
 
-  const enabledFiltered = filtered.filter((i) => !i.disabled);
+  const enabledFiltered = filtered.filter((i) => i.disabled);
 
   return (
killedBy: SearchableList Initial render should set all items as not active initially
statusReason: Error: expect(element).toHaveAttribute("data-active", "false") // element.getAttribute("data-active") === "false"

Expected the element to have attribute:
  data-active="false"
Received:
  data-active="true"

[Killed] ArrowFunction
src/components/SearchableList.tsx:125:19
         ref={inputRef}
         type="text"
         value={query}
-        onChange={(e) => setQuery(e.target.value)}
+        onChange={() => undefined}
         onKeyDown={handleKeyDown}
         placeholder={placeholder}
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <li aria-selected="false" data-active="false" data-testid="searchable-list-item-2" id="item-2" role="option"><span>Banana</span><span>A yellow fruit</span></li> instead

[Killed] EqualityOperator
src/components/SearchableList.tsx:129:24
         onKeyDown={handleKeyDown}
         placeholder={placeholder}
         role="combobox"
-        aria-expanded={filtered.length > 0}
+        aria-expanded={filtered.length >= 0}
         aria-controls="searchable-list-results"
         aria-activedescendant={
killedBy: SearchableList aria-expanded should set aria-expanded to false when no results
statusReason: Error: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:129:24
         onKeyDown={handleKeyDown}
         placeholder={placeholder}
         role="combobox"
-        aria-expanded={filtered.length > 0}
+        aria-expanded={true}
         aria-controls="searchable-list-results"
         aria-activedescendant={
killedBy: SearchableList aria-expanded should set aria-expanded to false when no results
statusReason: Error: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] EqualityOperator
src/components/SearchableList.tsx:132:11
         aria-expanded={filtered.length > 0}
         aria-controls="searchable-list-results"
         aria-activedescendant={
-          activeIndex >= 0 ? `item-${enabledFiltered[activeIndex]?.id}` : undefined
+          activeIndex < 0 ? `item-${enabledFiltered[activeIndex]?.id}` : undefined
         }
         data-testid="searchable-list-input"
killedBy: SearchableList Initial render should not have aria-activedescendant initially
statusReason: Error: expect(element).not.toHaveAttribute("aria-activedescendant") // element.hasAttribute("aria-activedescendant")

Expected the element not to have attribute:
  aria-activedescendant
Received:
  aria-activedescendant="item-undefined"

[Killed] ConditionalExpression
src/components/SearchableList.tsx:132:11
         aria-expanded={filtered.length > 0}
         aria-controls="searchable-list-results"
         aria-activedescendant={
-          activeIndex >= 0 ? `item-${enabledFiltered[activeIndex]?.id}` : undefined
+          false ? `item-${enabledFiltered[activeIndex]?.id}` : undefined
         }
         data-testid="searchable-list-input"
killedBy: SearchableList Keyboard navigation should set aria-activedescendant when navigating
statusReason: Error: expect(element).toHaveAttribute("aria-activedescendant", "item-1") // element.getAttribute("aria-activedescendant") === "item-1"

Expected the element to have attribute:
  aria-activedescendant="item-1"
Received:
  null
