[Killed] ConditionalExpression
src/components/SearchableList.tsx:137:8
         data-testid="searchable-list-input"
       />
 
-      {filtered.length === 0 && query.trim() !== '' ? (
+      {false ? (
         <div role="status" data-testid="searchable-list-no-results">
           {noResultsMessage}
killedBy: SearchableList Search/filtering with debounce should show no results message when no items match
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-no-results"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] LogicalOperator
src/components/SearchableList.tsx:137:8
         data-testid="searchable-list-input"
       />
 
-      {filtered.length === 0 && query.trim() !== '' ? (
+      {filtered.length === 0 || query.trim() !== '' ? (
         <div role="status" data-testid="searchable-list-no-results">
           {noResultsMessage}
killedBy: SearchableList Search/filtering with debounce should filter items after debounce delay
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="searchable-list-item-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] ConditionalExpression
src/components/SearchableList.tsx:150:30
         >
           {filtered.map((item, index) => {
             const enabledIndex = enabledFiltered.indexOf(item);
-            const isActive = enabledIndex === activeIndex;
+            const isActive = false;
 
             return (
killedBy: SearchableList Keyboard navigation should navigate down with ArrowDown
statusReason: Error: expect(element).toHaveAttribute("data-active", "true") // element.getAttribute("data-active") === "true"

Expected the element to have attribute:
  data-active="true"
Received:
  data-active="false"

[Killed] EqualityOperator
src/components/SearchableList.tsx:150:30
         >
           {filtered.map((item, index) => {
             const enabledIndex = enabledFiltered.indexOf(item);
-            const isActive = enabledIndex === activeIndex;
+            const isActive = enabledIndex !== activeIndex;
 
             return (
killedBy: SearchableList Initial render should set all items as not active initially
statusReason: Error: expect(element).toHaveAttribute("data-active", "false") // element.getAttribute("data-active") === "false"

Expected the element to have attribute:
  data-active="false"
Received:
  data-active="true"

[Killed] BlockStatement
src/components/SearchableList.tsx:161:32
                 aria-disabled={item.disabled}
                 data-active={isActive}
                 data-testid={`searchable-list-item-${item.id}`}
-                onClick={() => {
-                  if (!item.disabled) {
-                    onSelect(item);
-                  }
-                }}
+                onClick={() => {}}
               >
                 <span>{item.label}</span>
killedBy: SearchableList Click selection should call onSelect when clicking an enabled item
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "A yellow fruit", "id": "2", "label": "Banana"}

Number of calls: 0

[Killed] ConditionalExpression
src/components/SearchableList.tsx:162:23
                 data-active={isActive}
                 data-testid={`searchable-list-item-${item.id}`}
                 onClick={() => {
-                  if (!item.disabled) {
+                  if (true) {
                     onSelect(item);
                   }
killedBy: SearchableList Click selection should not call onSelect when clicking a disabled item
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"description": "A yellow fruit", "disabled": true, "id": "2", "label": "Banana"}

[Killed] BooleanLiteral
src/components/SearchableList.tsx:162:23
                 data-active={isActive}
                 data-testid={`searchable-list-item-${item.id}`}
                 onClick={() => {
-                  if (!item.disabled) {
+                  if (item.disabled) {
                     onSelect(item);
                   }
killedBy: SearchableList Click selection should call onSelect when clicking an enabled item
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "A yellow fruit", "id": "2", "label": "Banana"}

Number of calls: 0

[Killed] ConditionalExpression
src/components/SearchableList.tsx:168:18
                 }}
               >
                 <span>{item.label}</span>
-                {item.description && <span>{item.description}</span>}
+                {false}
               </li>
             );
killedBy: SearchableList Initial render should render item descriptions when present
statusReason: TestingLibraryElementError: Unable to find an element with the text: A red fruit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >

[Killed] ConditionalExpression
src/components/SearchableList.tsx:168:18
                 }}
               >
                 <span>{item.label}</span>
-                {item.description && <span>{item.description}</span>}
+                {true}
               </li>
             );
killedBy: SearchableList Initial render should render item descriptions when present
statusReason: TestingLibraryElementError: Unable to find an element with the text: A red fruit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="searchable-list"
    >
